; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	thermograph3 - mode
	thermograph0 - mode
	thermograph2 - mode
	image4 - mode
	image1 - mode
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Star4 - direction
	Star14 - direction
	GroundStation13 - direction
	GroundStation1 - direction
	Star10 - direction
	GroundStation9 - direction
	Star0 - direction
	GroundStation3 - direction
	Star11 - direction
	Star12 - direction
	GroundStation2 - direction
	Star8 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Planet18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star14)
	(calibration_target instrument0 Star4)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation13)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 GroundStation9)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star17)
	(supports instrument3 image4)
	(calibration_target instrument3 Star10)
	(supports instrument4 image1)
	(calibration_target instrument4 Star10)
	(calibration_target instrument4 GroundStation9)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon16)
	(supports instrument5 image4)
	(supports instrument5 thermograph2)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 GroundStation9)
	(calibration_target instrument5 Star12)
	(calibration_target instrument5 Star10)
	(supports instrument6 thermograph2)
	(supports instrument6 thermograph0)
	(supports instrument6 image4)
	(calibration_target instrument6 Star8)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 Star12)
	(calibration_target instrument6 Star11)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star17)
)
(:goal (and
	(have_image Planet15 image1)
	(have_image Phenomenon16 thermograph3)
	(have_image Star17 thermograph0)
	(have_image Planet18 thermograph0)
	(have_image Planet19 thermograph0)
))

)

; plan
1. (turn_to satellite2 groundstation9 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 groundstation9)
   goals met: 0 of 5
2. (turn_to satellite1 groundstation1 star17)
   deleted: (pointing satellite1 star17)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 5
3. (turn_to satellite0 star14 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star14)
   goals met: 0 of 5
4. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 5
5. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 5
6. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
7. (calibrate satellite2 instrument4 groundstation9)
   added: (calibrated instrument4)
   goals met: 0 of 5
8. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 5
9. (calibrate satellite0 instrument0 star14)
   added: (calibrated instrument0)
   goals met: 0 of 5
10. (turn_to satellite0 planet18 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 planet18)
   goals met: 0 of 5
11. (take_image satellite0 planet18 instrument0 thermograph0)
   added: (have_image planet18 thermograph0)
   goals met: 1 of 5
12. (turn_to satellite0 planet19 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet19)
   goals met: 1 of 5
13. (take_image satellite0 planet19 instrument0 thermograph0)
   added: (have_image planet19 thermograph0)
   goals met: 2 of 5
14. (turn_to satellite0 star17 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 star17)
   goals met: 2 of 5
15. (take_image satellite0 star17 instrument0 thermograph0)
   added: (have_image star17 thermograph0)
   goals met: 3 of 5
16. (turn_to satellite1 phenomenon16 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon16)
   goals met: 3 of 5
17. (take_image satellite1 phenomenon16 instrument2 thermograph3)
   added: (have_image phenomenon16 thermograph3)
   goals met: 4 of 5
18. (turn_to satellite2 planet15 groundstation9)
   deleted: (pointing satellite2 groundstation9)
   added: (pointing satellite2 planet15)
   goals met: 4 of 5
19. (take_image satellite2 planet15 instrument4 image1)
   added: (have_image planet15 image1)
   goals met: 5 of 5
